In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from datetime import datetime

In [4]:
myyear=2015
mymonth=1
myday=1
myhour=2
mymin=30
mysec=15

In [5]:
mydate=datetime(myyear,mymonth,myday)

In [6]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [7]:
mydatetime=datetime(myyear,mymonth,myday,myhour,myhour,mysec)

In [8]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 2, 15)

In [9]:
mydatetime.year

2015

In [10]:
myser=pd.Series(['Nov 3,1990','2000-01-01',None])

In [11]:
myser

0    Nov 3,1990
1    2000-01-01
2          None
dtype: object

In [12]:
myser[0]

'Nov 3,1990'

In [13]:
pd.to_datetime(myser)

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [14]:
timeser=pd.to_datetime(myser)

In [15]:
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [16]:
timeser[0]

Timestamp('1990-11-03 00:00:00')

In [17]:
timeser[0].year

1990

In [18]:
obvi_euro_date='31-12-2000'

In [19]:
pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [20]:
euro_date='10-12-2000'

In [22]:
pd.to_datetime(euro_date)

Timestamp('2000-10-12 00:00:00')

In [23]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [24]:
style_date='12--Dec--2000'

In [25]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [26]:
custom_date="12th of Dec 2000"

In [27]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [61]:
sales=pd.read_csv(r'C:\Users\German\Desktop\RetailSales_BeerWineLiquor.csv')

In [62]:
sales

           DATE  S4248SM144NCEN
0    1992-01-01            3459
1    1992-02-01            3458
2    1992-03-01            4002
3    1992-04-01            4564
4    1992-05-01            4221
..          ...             ...
335  2019-12-01            8557
336  2020-01-01            6520
337  2020-02-01            3075
338  2020-03-01            5326
339  2020-04-01            5210

[340 rows x 2 columns]

In [63]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [64]:
sales['DATE']=pd.to_datetime(sales["DATE"])

In [65]:
sales

          DATE  S4248SM144NCEN
0   1992-01-01            3459
1   1992-02-01            3458
2   1992-03-01            4002
3   1992-04-01            4564
4   1992-05-01            4221
..         ...             ...
335 2019-12-01            8557
336 2020-01-01            6520
337 2020-02-01            3075
338 2020-03-01            5326
339 2020-04-01            5210

[340 rows x 2 columns]

In [67]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [68]:
sales['DATE'][0].year

1992

In [69]:
sales.head()

        DATE  S4248SM144NCEN
0 1992-01-01            3459
1 1992-02-01            3458
2 1992-03-01            4002
3 1992-04-01            4564
4 1992-05-01            4221

In [70]:
sales=pd.read_csv(r'C:\Users\German\Desktop\RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [71]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [72]:
sales

          DATE  S4248SM144NCEN
0   1992-01-01            3459
1   1992-02-01            3458
2   1992-03-01            4002
3   1992-04-01            4564
4   1992-05-01            4221
..         ...             ...
335 2019-12-01            8557
336 2020-01-01            6520
337 2020-02-01            3075
338 2020-03-01            5326
339 2020-04-01            5210

[340 rows x 2 columns]

In [73]:
sales=sales.set_index("DATE")

In [74]:
sales

            S4248SM144NCEN
DATE
1992-01-01            3459
1992-02-01            3458
1992-03-01            4002
1992-04-01            4564
1992-05-01            4221
...                    ...
2019-12-01            8557
2020-01-01            6520
2020-02-01            3075
2020-03-01            5326
2020-04-01            5210

[340 rows x 1 columns]

In [75]:
sales.resample(rule='A')

In [76]:
sales.resample(rule='A').mean()

            S4248SM144NCEN
DATE
1992-12-31     4199.750000
1993-12-31     4235.083333
1994-12-31     4335.083333
1995-12-31     4374.583333
1996-12-31     4662.083333
1997-12-31     4859.333333
1998-12-31     5146.583333
1999-12-31     5610.833333
2000-12-31     5944.750000
2001-12-31     6237.833333
2002-12-31     6599.083333
2003-12-31     6903.666667
2004-12-31     7243.166667
2005-12-31     7685.416667
2006-12-31     8198.500000
2007-12-31     8652.083333
2008-12-31     9108.750000
2009-12-31     9066.583333
2010-12-31     9278.750000
2011-12-31     9701.833333
2012-12-31    10170.333333
2013-12-31    10834.833333
2014-12-31    10892.916667
2015-12-31    11374.166667
2016-12-31    11973.250000
2017-12-31    12392.000000
2018-12-31    13015.583333
2019-12-31    11307.583333
2020-12-31     5032.750000

In [77]:
sales.resample(rule='B').mean()

            S4248SM144NCEN
DATE
1992-01-01          3459.0
1992-01-02             NaN
1992-01-03             NaN
1992-01-06             NaN
1992-01-07             NaN
...                    ...
2020-03-26             NaN
2020-03-27             NaN
2020-03-30             NaN
2020-03-31             NaN
2020-04-01          5210.0

[7371 rows x 1 columns]

In [78]:
sales.resample(rule='C').mean()

            S4248SM144NCEN
DATE
1992-01-01          3459.0
1992-01-02             NaN
1992-01-03             NaN
1992-01-06             NaN
1992-01-07             NaN
...                    ...
2020-03-26             NaN
2020-03-27             NaN
2020-03-30             NaN
2020-03-31             NaN
2020-04-01          5210.0

[7371 rows x 1 columns]

In [79]:
sales=pd.read_csv(r'C:\Users\German\Desktop\RetailSales_BeerWineLiquor.csv',parse_dates=[1])

In [80]:
sales

           DATE S4248SM144NCEN
0    1992-01-01           3459
1    1992-02-01           3458
2    1992-03-01           4002
3    1992-04-01           4564
4    1992-05-01           4221
..          ...            ...
335  2019-12-01           8557
336  2020-01-01           6520
337  2020-02-01           3075
338  2020-03-01           5326
339  2020-04-01           5210

[340 rows x 2 columns]

In [81]:
sales=pd.read_csv(r'C:\Users\German\Desktop\RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [82]:
sales.head()

        DATE  S4248SM144NCEN
0 1992-01-01            3459
1 1992-02-01            3458
2 1992-03-01            4002
3 1992-04-01            4564
4 1992-05-01            4221

In [83]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   DATE            340 non-null    datetime64[ns]
 1   S4248SM144NCEN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [84]:
sales['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [85]:
sales['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64